tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "shivammathur/php"
tap "teamookla/speedtest"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Official Amazon AWS command-line interface
brew "awscli"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Clean Docker containers, images, networks, and volumes
brew "docker-clean"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# AST-based pattern checker for JavaScript
brew "eslint"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Firebase command-line tools
brew "firebase-cli"
# Command-line utility for Gulp
brew "gulp-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Python version management
brew "pyenv"
# Command-line YAML and XML processor that wraps jq
brew "python-yq"
# Static http server anywhere you need one
brew "serve"
# Standard Tooling for Vue.js Development
brew "vue-cli"
# JavaScript package manager
brew "yarn"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Enable Windows-like alt-tab
cask "alt-tab"
# Tools for building Android applications
cask "android-studio"
# Application uninstaller
cask "appcleaner"
# 3D creation suite
cask "blender"
# Web browser focusing on privacy
cask "brave-browser"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Vietnamese keyboard
cask "evkey"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Monospaced font that includes programming ligatures
cask "font-cascadia-code"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Variable font designed for display
cask "font-inter"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
cask "font-lato"
# Monospace font customized for Powerlevel10k
cask "font-meslo-for-powerlevel10k"
# GIT client
cask "fork"
# Web browser
cask "google-chrome"
# Utility to hide menu bar items
cask "hiddenbar"
# Menu bar calendar
cask "itsycal"
# File archiver
cask "keka"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Utility that shows the latest app updates
cask "latest"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Email client
cask "microsoft-outlook"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Finder Toolbar app to open the current directory in Terminal or Editor
cask "openinterminal"
# Web browser
cask "opera"
# Replacement for Docker Desktop
cask "orbstack"
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin to view patch files
cask "qlprettypatch"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Quick Look plugin for CSV files
cask "quicklook-csv"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Control your tools with a few keystrokes
cask "raycast"
# MySQL/MariaDB database management
cask "sequel-ace"
# Screenshot measurement and annotation tool
cask "shottr"
# Graphical client for Git version control
cask "sourcetree"
# Utility to hide the notch
cask "topnotch"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Multiplayer code editor
cask "zed"
mas "Bitwarden", id: 1352778147
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "OneDrive", id: 823766827
mas "Telegram", id: 747648890
mas "Tot", id: 1491071483
mas "Xcode", id: 497799835
