tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "shivammathur/php"
tap "teamookla/speedtest"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Official Amazon AWS command-line interface
brew "awscli"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Clean Docker containers, images, networks, and volumes
brew "docker-clean"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Firebase command-line tools
brew "firebase-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# Python version management
brew "pyenv"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# JavaScript package manager
brew "yarn"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Enable Windows-like alt-tab
cask "alt-tab"
# Tools for building Android applications
cask "android-studio"
# Application uninstaller
cask "appcleaner"
# 3D creation suite
cask "blender"
# Web browser focusing on privacy
cask "brave-browser"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Vietnamese keyboard
cask "evkey"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Monospaced font that includes programming ligatures
cask "font-cascadia-code"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Variable font designed for display
cask "font-inter"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
cask "font-lato"
# Superfamily of fonts for code
cask "font-monaspace"
# Quasi-proportional monospace font based on Iosevka
cask "font-zed-mono"
# Quasi-proportional sans-serif font based on Iosevka
cask "font-zed-sans"
# GIT client
cask "fork"
# Web browser
cask "google-chrome"
# Utility to hide menu bar items
cask "hiddenbar"
# Menu bar calendar
cask "itsycal"
# File archiver
cask "keka"
# Utility that shows the latest app updates
cask "latest"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Email client
cask "microsoft-outlook"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# App to write, plan, collaborate, and get organised
cask "notion"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Finder Toolbar app to open the current directory in Terminal or Editor
cask "openinterminal"
# Web browser
cask "opera"
# Replacement for Docker Desktop
cask "orbstack"
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin to view patch files
cask "qlprettypatch"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Quick Look plugin for CSV files
cask "quicklook-csv"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Control your tools with a few keystrokes
cask "raycast"
# MySQL/MariaDB database management
cask "sequel-ace"
# Screenshot measurement and annotation tool
cask "shottr"
# Graphical client for Git version control
cask "sourcetree"
# Application for inspecting installer packages
cask "suspicious-package"
# Utility to hide the notch
cask "topnotch"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Multiplayer code editor
cask "zed"
mas "Bitwarden", id: 1352778147
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "OneDrive", id: 823766827
mas "Resident Evil 4", id: 6462360082
mas "Telegram", id: 747648890
mas "Tot", id: 1491071483
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "ahmadalli.vscode-nginx-conf"
vscode "alefragnani.project-manager"
vscode "ambooth.git-rename"
vscode "antfu.browse-lite"
vscode "antfu.file-nesting"
vscode "antfu.icons-carbon"
vscode "anweber.reveal-button"
vscode "atlassian.atlascode"
vscode "austinleegordon.vscode-schema-dot-org"
vscode "brandonkirbyson.vscode-animations"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "chrmarti.regex"
vscode "cipchk.cssrem"
vscode "codeandstuff.package-json-upgrade"
vscode "codeium.codeium"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deque-systems.vscode-axe-linter"
vscode "drcika.apc-extension"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "equinusocio.moxer-icons"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "gruntfuggly.todo-tree"
vscode "gurumukhi.selected-lines-count"
vscode "helixquar.randomeverything"
vscode "ibm.output-colorizer"
vscode "jasonnutter.search-node-modules"
vscode "jock.svg"
vscode "julienetie.vscode-template-literals"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "lkrms.inifmt"
vscode "meganrogge.template-string-converter"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "miguelsolorio.min-theme"
vscode "miguelsolorio.symbols"
vscode "mousavian.ssh-config-syntax-highlighter"
vscode "mrmlnc.vscode-autoprefixer"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "mutantdino.resourcemonitor"
vscode "oderwat.indent-rainbow"
vscode "peterschmalfeldt.explorer-exclude"
vscode "pmneo.tsimporter"
vscode "quicktype.quicktype"
vscode "raillyhugo.one-hunter"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "sburg.vscode-javascript-booster"
vscode "sleistner.vscode-fileutils"
vscode "spikespaz.vscode-smoothtype"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-medical-terms"
vscode "streetsidesoftware.code-spell-checker-scientific-terms"
vscode "streetsidesoftware.code-spell-checker-vietnamese"
vscode "stylelint.vscode-stylelint"
vscode "sveggiani.vscode-field-lights"
vscode "syler.sass-indented"
vscode "tomoki1207.pdf"
vscode "tyriar.sort-lines"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudioexptteam.vscodeintellicode-completions"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "wmaurer.change-case"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
vscode "ziterz.codesandbox-black-theme"
